# AssemblyMemberDifferentParameters Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssemblyMemberDifferentParameters Class
Members See Also
---
The two assembly members being compared have different parameters
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class AssemblyMemberDifferentParameters : AssemblyMemberDifference
```

Visual Basic
---
```text
Public Class AssemblyMemberDifferentParameters _
	Inherits AssemblyMemberDifference
```

Visual C++
---
```text
public ref class AssemblyMemberDifferentParameters : public AssemblyMemberDifference
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..AssemblyMemberDifference Autodesk.Revit.DB..::..AssemblyMemberDifferentParameters
# See Also
AssemblyMemberDifferentParameters Members
Autodesk.Revit.DB Namespace